const getMe = async (req, res) => {
  try {
    const user = req.user; //Энэ мөр нь хэрэглэгчийн объектыг req (хүсэлт) объектоос гаргаж авдаг.
    // Энэ хэрэглэгчийн объект нь ихэвчлэн нэвтрэлт танилт болон зөвшөөрлийг зохицуулдаг завсрын програмаар дүүрдэг.
    //Дунд програм нь JWT эсвэл сессээс хэрэглэгчийн мэдээллийг гаргаж аваад req объект руу хавсаргаж болно.

    res.json(user); //Энэ мөр нь хэрэглэгчийн объектыг JSON хариу хэлбэрээр үйлчлүүлэгч рүү илгээдэг.
    //Энэ нь үйлчлүүлэгчид хэрэглэгчийн нэр, цахим шуудан эсвэл бусад холбогдох мэдээлэл гэх мэт одоогийн
    //баталгаажуулсан хэрэглэгчийн талаарх мэдээллийг хүлээн авч ашиглах боломжийг олгодог.
  } catch (error) {
    console.error(error);
    res.status(500).json({ error: "Internal Server Error" });
  }
};

module.exports = { getMe };
